app/views/orders/_orders_in_progress.haml


    - @order.order_items.each do |order_item|
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 7]]