app/views/orders/index.haml

  %h3= t('header.orders')
  - if @order.order_items.count > 0
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 2]]