app/views/order_items/_cart_table.haml

        %table
          =render('order_item', collection: @order.order_items, locals: { f: f})
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 19]]