app/controllers/books_controller.rb

SELECT  "books".* FROM "books" LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
SELECT "categories".* FROM "categories"
---
  def index
    @books = Book.page(params[:page]).per(6)
    @categories = Category.all

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."book_id" = $1 AND "ratings"."approval" = $2  [["book_id", 3], ["approval", true]]
---
  def show
    @book = Book.find_by(id: params[:id])
    @ratings = Rating.where(book_id: params[:id], approval: true)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def add_rating
    @book = Book.find_by(id: params[:id])