app/controllers/categories_controller.rb

SELECT COUNT(DISTINCT "books"."id") FROM "books" LEFT OUTER JOIN "books_categories" ON "books_categories"."book_id" = "books"."id" LEFT OUTER JOIN "categories" ON "categories"."id" = "books_categories"."category_id" WHERE "categories"."title" = $1  [["title", "Fiction"]]
SELECT "categories".* FROM "categories"
---
  def category
    @category_title = params[:category]
    @books = Book.includes(:categories)
                 .where("categories.title" => @category_title)
                 .page(params[:page]).per(12)
    @categories = Category.all