app/controllers/checkouts_controller.rb

SELECT "countries"."name" FROM "countries"
---
  def address
    @address = Address.new
    @countries = Country.pluck(:name)

INSERT INTO "addresses" ("firstname", "lastname", "address", "zipcode", "city", "phone", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "orders" SET "billing_address_id" = $1, "shipping_address_id" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["billing_address_id", 1], ["shipping_address_id", 1], ["updated_at", 2016-07-22 14:49:14 UTC], ["id", 1]]
---
  def address_confirm
    @billing_address = Address.create(address_params)
    if params[:use_billing]
      current_order.update(billing_address: @billing_address, shipping_address: @billing_address)

UPDATE "orders" SET "order_total" = 25.0 WHERE "orders"."id" = $1  [["id", 1]]
---
  def delivery_confirm
    current_order.update(shipping: params[:shipping_price])

INSERT INTO "credit_cards" ("number", "cvv", "expiration_month", "expiration_year", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "orders" SET "credit_card_id" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["credit_card_id", 1], ["updated_at", 2016-07-22 14:49:21 UTC], ["id", 1]]
---
  def payment_confirm
    @credit_card = CreditCard.create(credit_card_params)
    current_order.update(credit_card: @credit_card)

UPDATE "orders" SET "state" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["state", "in_queue"], ["updated_at", 2016-07-22 15:04:28 UTC], ["id", 1]]
---
  def complete
    @order = current_order
    @billing_address = @order.billing_address.decorate
    @shipping_address = @order.shipping_address.decorate
    @credit_card = @order.credit_card

    @order.update(state: 'processing')