app/controllers/order_items_controller.rb

  def index
    @order_items = @order.order_items
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]

  def update_all
    params[:quantity].each do |item_id, quantity|
      @order.order_items.find_by_id(item_id).update(:quantity => quantity)
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT $3  [["order_id", 19], ["id", 11], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 1], ["updated_at", 2016-07-28 14:18:28 UTC], ["id", 11]]
UPDATE "orders" SET "discount" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["discount", #<BigDecimal:7f9afa7ac1b8,'0.1E1',9(18)>], ["updated_at", 2016-07-28 14:22:41 UTC], ["id", 19]]