app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 1 AND "orders"."state" = $1  [["state", "in_queue"]]
---
  def index
    @order = current_order
    @orders_processing = Order.where(user: current_user, state: 'processing')