app/controllers/profiles_controller.rb

  def edit
    @address_form = AddressForm.new(Address.new)
    @countries = Country.pluck(:name)
---
SELECT "countries"."name" FROM "countries"